'''
Дан файл f, компоненти якого є дійсними числами. Знайти найбільше із значень
компонентів, найменше зі значень компонентів з парними номерами, суму найбільшого
і найменшого із значень компонентів, різницю першої і останньої компоненти файлу.
Постолович А.С. 122-В
'''
import random

n = int(input('Виберіть кількість чисел у файлі: '))
z = [] #створюємо список з усіма значеннями
x = [] #створюжмо список з значеннями чисел з парними індексами
f = open('f.txt', 'wb') #відкриваємо файл для запису в двійковому режимі
f.write(bytearray([random.randint(0,255) for i in range(n)])) #записуємо в файл рандомні числа
f = open('f.txt', 'rb') #відкриваємо файл для читання в двійковому режимі
a = f.read() #присвоюємо змінній значення з файлу
f.close() #закриваємо файл

for i in a: #додаємо всі числа з файлу в список
    z.append(i)
for i in range(len(z)):
    if i%2 == 0: #додаємо в список всі числа з парними індексами
        x.append(z[i])

z_max = max(z)
x_min = min(x)
sum_1 = max(z)+min(z)
dif_1 = z[0]-z[-1]


print(f'Макслимальне число в файлі - {z_max}\n'
      f'Мінімільне число серед чисел з парним індексом - {x_min}\n'
      f'Сума найбільшого і найменшого чисал в файлі - {sum_1} \n'
      f'Різниця першого і останнього числа - {dif_1}')