'''
Дан файл f, компоненти якого є цілими числами. Переписати у файл g всі
компоненти файлу f замінивши всі від’ємні числа на 0.
Постолович А.С.
'''

import random

n = int(input('Виберіть кількість чисел у файлі: '))
z = [random.randint(-100,100) for i in range(n)] #створюємо послідовність довільних чисел
k = 0 # створюємо лічильник від'ємних чисел
f = open('f.txt', 'w') #відкриваємо перший файл
for i in range(n):
    f.write(str(z[i])) # записуємо в перший файл всі числа з послідовності
f.close()
f = open('g.txt', 'w') # відкриваємо другий файл
for i in range(n):
    if z[i] < 0: # записуємо в файли чилса, замінюючи від'ємні на нуль
        z[i] = 0
        f.write(str(z[i]))
        k += 1
    else:
        f.write(str(z[i]))
print(f"Кількість від'ємних чисел - {k}")